<!doctype html>



  


<html class="theme-next pisces use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  
    
      
    

    
  

  

  
    
      
    

    
  

  
    
      
    

    
  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Monda:300,300italic,400,400italic,700,700italic|Roboto Slab:300,300italic,400,400italic,700,700italic|Lobster Two:300,300italic,400,400italic,700,700italic|PT Mono:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.0.1" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="JVM," />





  <link rel="alternate" href="/atom.xml" title="Yuyaoxia's Blog" type="application/atom+xml" />




  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.0.1" />






<meta name="description" content="java&amp;#x8FD0;&amp;#x884C;&amp;#x65F6;&amp;#x6570;&amp;#x636E;&amp;#x533A;&amp;#xFF1A;java&amp;#x865A;&amp;#x62DF;&amp;#x673A;&amp;#x5806;&amp;#x3001;java&amp;#x865A;&amp;#x62DF;&amp;#x673A;&amp;#x6808;&amp;#x3001;&amp;#x7A0B;&amp;#x5E8F;&amp;#x8BA1;&amp;#x6570;&amp;#x5668;&amp;#x3001;&amp;#x6">
<meta property="og:type" content="article">
<meta property="og:title" content="jvm内存模型 ">
<meta property="og:url" content="http://yoursite.com/2017/10/08/jvm-memory-model/index.html">
<meta property="og:site_name" content="Yuyaoxia's Blog">
<meta property="og:description" content="java&amp;#x8FD0;&amp;#x884C;&amp;#x65F6;&amp;#x6570;&amp;#x636E;&amp;#x533A;&amp;#xFF1A;java&amp;#x865A;&amp;#x62DF;&amp;#x673A;&amp;#x5806;&amp;#x3001;java&amp;#x865A;&amp;#x62DF;&amp;#x673A;&amp;#x6808;&amp;#x3001;&amp;#x7A0B;&amp;#x5E8F;&amp;#x8BA1;&amp;#x6570;&amp;#x5668;&amp;#x3001;&amp;#x6">
<meta property="og:updated_time" content="2017-10-08T02:52:14.200Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="jvm内存模型 ">
<meta name="twitter:description" content="java&amp;#x8FD0;&amp;#x884C;&amp;#x65F6;&amp;#x6570;&amp;#x636E;&amp;#x533A;&amp;#xFF1A;java&amp;#x865A;&amp;#x62DF;&amp;#x673A;&amp;#x5806;&amp;#x3001;java&amp;#x865A;&amp;#x62DF;&amp;#x673A;&amp;#x6808;&amp;#x3001;&amp;#x7A0B;&amp;#x5E8F;&amp;#x8BA1;&amp;#x6570;&amp;#x5668;&amp;#x3001;&amp;#x6">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Pisces',
    sidebar: {"position":"right","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>

  <title> jvm内存模型  | Yuyaoxia's Blog </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  










  
  
    
  

  <div class="container one-collumn sidebar-position-right page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">Yuyaoxia's Blog</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle"></p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-th"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            关于
          </a>
        </li>
      

      
        <li class="menu-item menu-item-search">
          
            <a href="#" class="popup-trigger">
          
            
              <i class="menu-item-icon fa fa-search fa-fw"></i> <br />
            
            搜索
          </a>
        </li>
      
    </ul>
  

  
    <div class="site-search">
      
  <div class="popup">
 <span class="search-icon fa fa-search"></span>
 <input type="text" id="local-search-input">
 <div id="local-search-result"></div>
 <span class="popup-btn-close">close</span>
</div>


    </div>
  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                jvm内存模型 
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2017-10-08T10:47:26+08:00" content="2017-10-08">
              2017-10-08
            </time>
          </span>

          

          
            
          

          

          
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>java&#x8FD0;&#x884C;&#x65F6;&#x6570;&#x636E;&#x533A;&#xFF1A;java&#x865A;&#x62DF;&#x673A;&#x5806;&#x3001;java&#x865A;&#x62DF;&#x673A;&#x6808;&#x3001;&#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668;&#x3001;&#x672C;&#x5730;&#x65B9;&#x6CD5;&#x6808;&#x3001;&#x65B9;&#x6CD5;&#x533A;</p>
<p>java&#x865A;&#x62DF;&#x673A;&#x7684;&#x591A;&#x7EBF;&#x7A0B;&#x662F;&#x901A;&#x8FC7;&#x7EBF;&#x7A0B;&#x8F6E;&#x6D41;&#x5207;&#x6362;&#x5E76;&#x5206;&#x914D;&#x5904;&#x7406;&#x5668;&#x6267;&#x884C;&#x65F6;&#x95F4;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x5728;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x786E;&#x5B9A;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x4E00;&#x4E2A;&#x5904;&#x7406;&#x5668;&#x90FD;&#x53EA;&#x4F1A;&#x6267;&#x884C;&#x4E00;&#x6761;&#x7EBF;&#x7A0B;&#x4E2D;&#x7684;&#x6307;&#x4EE4;<br><a id="more"></a><br><span style="color:red;">|&#x2014;</span> &#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668;&#xFF1A;&#x5F53;&#x524D;&#x7A0B;&#x5E8F;&#x6240;&#x6267;&#x884C;&#x7684;&#x5B57;&#x8282;&#x7801;&#x7684;&#x884C;&#x53F7;&#x6307;&#x793A;&#x5668;&#xFF0C;&#x5B57;&#x8282;&#x7801;&#x89E3;&#x91CA;&#x5668;&#x5DE5;&#x4F5C;&#x65F6;&#x5C31;&#x662F;&#x901A;&#x8FC7;&#x6539;&#x53D8;&#x8FD9;&#x4E2A;&#x8BA1;&#x6570;&#x5668;&#x503C;&#x6765;&#x9009;&#x53D6;&#x4E0B;&#x4E00;&#x6761;&#x9700;&#x8981;&#x6267;&#x884C;&#x7684;&#x5B57;&#x8282;&#x7801;&#x6307;&#x4EE4;&#xFF0C;&#x5206;&#x652F;&#x3001;&#x5FAA;&#x73AF;&#x3001;&#x8DF3;&#x8F6C;&#x3001;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x3001;&#x7EBF;&#x7A0B;&#x6062;&#x590D;&#x7B49;&#x57FA;&#x7840;&#x529F;&#x80FD;&#x90FD;&#x9700;&#x8981;&#x4F9D;&#x8D56;&#x8FD9;&#x4E2A;&#x8BA1;&#x6570;&#x5668;<br>&#x6BCF;&#x4E2A;&#x7EBF;&#x7A0B;&#x62E5;&#x6709;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668;&#xFF0C;&#x4E92;&#x4E0D;&#x5F71;&#x54CD;&#x72EC;&#x7ACB;&#x5B58;&#x50A8;&#xFF0C;&#x6545;&#x79F0;&#x4E3A;&#x201C;&#x7EBF;&#x7A0B;&#x79C1;&#x6709;&#x201D;&#x7684;&#x5185;&#x5B58;&#x3002;<br>&#x5982;&#x679C;&#x7EBF;&#x7A0B;&#x6B63;&#x5728;&#x6267;&#x884C;&#x7684;&#x662F;&#x4E00;&#x4E2A;java&#x65B9;&#x6CD5;&#xFF0C;&#x8FD9;&#x4E2A;&#x8BA1;&#x6570;&#x5668;&#x8BB0;&#x5F55;&#x7684;&#x662F;&#x6B63;&#x5728;&#x6267;&#x884C;&#x7684;&#x865A;&#x62DF;&#x673A;&#x5B57;&#x8282;&#x7801;&#x6307;&#x4EE4;&#x5730;&#x5740;&#xFF1B;&#x5982;&#x679C;&#x6B63;&#x5728;&#x6267;&#x884C;&#x7684;&#x662F;native&#x65B9;&#x6CD5;&#xFF0C;&#x8FD9;&#x4E2A;&#x8BA1;&#x6570;&#x5668;&#x5219;&#x4E3A;&#x7A7A;&#xFF08;undifined&#xFF09;&#x3002;<br>&#x6B64;&#x5185;&#x5B58;&#x533A;&#x57DF;&#x662F;java&#x865A;&#x62DF;&#x673A;&#x89C4;&#x8303;&#x4E2D;&#x6CA1;&#x6709;&#x89C4;&#x5B9A;&#x4EFB;&#x4F55;OutOfmemoryError&#x60C5;&#x51B5;&#x7684;&#x533A;&#x57DF;<br><span style="color:red;">|&#x2014;</span> Java&#x865A;&#x62DF;&#x673A;&#x6808;&#xFF1A;&#x63CF;&#x8FF0;&#x7684;&#x662F;java&#x65B9;&#x6CD5;&#x6267;&#x884C;&#x7684;&#x5185;&#x5B58;&#x6A21;&#x578B;&#x3002;&#x6BCF;&#x4E2A;&#x65B9;&#x6CD5;&#x5728;&#x6267;&#x884C;&#x7684;&#x540C;&#x65F6;&#x90FD;&#x4F1A;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5E27;&#x6808;&#xFF08;Stack Frame&#xFF09;&#x7528;&#x4E8E;&#x5B58;&#x50A8;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x8868;&#x3001;&#x64CD;&#x4F5C;&#x6570;&#x6808;&#x3001;&#x52A8;&#x6001;&#x94FE;&#x63A5;&#x3001;&#x65B9;&#x6CD5;&#x7684;&#x51FA;&#x53E3;&#x7B49;&#x4FE1;&#x606F;&#xFF0C;&#x6BCF;&#x4E2A;&#x65B9;&#x6CD5;&#x4ECE;&#x8C03;&#x7528;&#x76F4;&#x81F3;&#x6267;&#x884C;&#x5B8C;&#x6210;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x5C31;&#x5BF9;&#x5E94;&#x7740;&#x4E00;&#x4E2A;&#x6808;&#x5E27;&#x5728;&#x865A;&#x62DF;&#x673A;&#x4E2D;&#x5165;&#x6808;&#x5230;&#x51FA;&#x6808;&#x7684;&#x8FC7;&#x7A0B;&#x3002;<br>    -Xss:&#x63A7;&#x5236;&#x5185;&#x5B58;&#x5927;&#x5C0F;<br>&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x8868;&#xFF1A;&#x5B58;&#x653E;&#x4E86;&#x7F16;&#x8BD1;&#x671F;&#x53EF;&#x77E5;&#x7684;&#x5404;&#x79CD;&#x57FA;&#x672C;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x3001;&#x5BF9;&#x8C61;&#x5F15;&#x7528;&#xFF08;reference&#x7C7B;&#x578B;&#xFF0C;&#x5B83;&#x4E0D;&#x540C;&#x4E8E;&#x5BF9;&#x8C61;&#x672C;&#x8EAB;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#x4E00;&#x4E2A;&#x6307;&#x5411;&#x5BF9;&#x8C61;&#x8D77;&#x59CB;&#x5730;&#x5740;&#x7684;&#x5F15;&#x7528;&#x6307;&#x9488;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x662F;&#x6307;&#x5411;&#x4E00;&#x4E2A;&#x4EE3;&#x8868;&#x5BF9;&#x8C61;&#x7684;&#x53E5;&#x67C4;&#x6216;&#x5176;&#x4ED6;&#x4E0E;&#x6B64;&#x5BF9;&#x8C61;&#x76F8;&#x5173;&#x7684;&#x4F4D;&#x7F6E;&#xFF09;&#x548C;returnAddress&#x7C7B;&#x578B;&#xFF08;&#x6307;&#x5411;&#x4E86;&#x4E00;&#x6761;&#x5B57;&#x8282;&#x7801;&#x6307;&#x4EE4;&#x7684;&#x5730;&#x5740;&#xFF09;</p>
<p>&#x5176;&#x4E2D;64&#x4F4D;&#x957F;&#x5EA6;&#x7684;long&#x548C;double&#x7C7B;&#x578B;&#x7684;&#x6570;&#x636E;&#x4F1A;&#x5360;2&#x4E2A;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x7A7A;&#x95F4;&#xFF0C;&#x5176;&#x4F59;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x53EA;&#x5360;&#x7528;1&#x4E2A;&#x3002;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x8868;&#x6240;&#x9700;&#x7684;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#x5728;&#x7F16;&#x8BD1;&#x671F;&#x95F4;&#x5B8C;&#x6210;&#x5206;&#x914D;&#xFF0C;&#x5F53;&#x8FDB;&#x5165;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x65F6;&#xFF0C;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x9700;&#x8981;&#x5728;&#x5E27;&#x4E2D;&#x5206;&#x914D;&#x591A;&#x5927;&#x7684;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x7A7A;&#x95F4;&#x662F;&#x5B8C;&#x5168;&#x786E;&#x5B9A;&#x7684;&#xFF0C;&#x5728;&#x65B9;&#x6CD5;&#x8FD0;&#x884C;&#x671F;&#x95F4;&#x4E0D;&#x4F1A;&#x6539;&#x53D8;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x8868;&#x7684;&#x5927;&#x5C0F;&#x3002;</p>
<p>&#x6709;&#x4E24;&#x79CD;&#x5F02;&#x5E38;&#x72B6;&#x51B5;&#xFF1A;<br>    1&#x3001;StackOverflowError&#xFF1A;&#x5982;&#x679C;&#x7EBF;&#x7A0B;&#x8BF7;&#x6C42;&#x7684;&#x6808;&#x6DF1;&#x5EA6;&#x5927;&#x4E8E;&#x865A;&#x62DF;&#x673A;&#x6240;&#x5141;&#x8BB8;&#x7684;&#x6DF1;&#x5EA6;<br>    2&#x3001;OutOfMemoryError&#xFF1A;&#x5982;&#x679C;&#x865A;&#x62DF;&#x673A;&#x6808;&#x53EF;&#x4EE5;&#x52A8;&#x6001;&#x6269;&#x5C55;&#xFF08;&#x5F53;&#x524D;&#x5927;&#x90E8;&#x5206;java&#x865A;&#x62DF;&#x673A;&#x90FD;&#x53EF;&#x52A8;&#x6001;&#x6269;&#x5C55;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;java&#x865A;&#x62DF;&#x673A;&#x89C4;&#x8303;&#x4E2D;&#x4E5F;&#x5141;&#x8BB8;&#x56FA;&#x5B9A;&#x957F;&#x5EA6;&#x7684;&#x865A;&#x62DF;&#x673A;&#x6808;&#xFF09;&#xFF0C;&#x5982;&#x679C;&#x6269;&#x5C55;&#x65F6;&#x65E0;&#x6CD5;&#x7533;&#x8BF7;&#x5230;&#x8DB3;&#x591F;&#x7684;&#x5185;&#x5B58;&#x3002;<br>&#x5F02;&#x5E38;&#x60C5;&#x51B5;<br>&#x751F;&#x547D;&#x5468;&#x671F;&#x8DDF;&#x7EBF;&#x7A0B;&#x76F8;&#x540C;<br>&#x201C;&#x7EBF;&#x7A0B;&#x79C1;&#x6709;&#x201D;&#x7684;&#x5185;&#x5B58;<br><span style="color:red;">|&#x2014;</span> &#x672C;&#x5730;&#x65B9;&#x6CD5;&#x6808;&#xFF1A;&#x4E0E;java&#x865A;&#x62DF;&#x673A;&#x6808;&#x53D1;&#x6325;&#x7684;&#x4F5C;&#x7528;&#x4E00;&#x6837;&#xFF0C;&#x533A;&#x522B;&#x5728;&#x4E8E;&#x865A;&#x62DF;&#x673A;&#x6808;&#x4E3A;&#x865A;&#x62DF;&#x673A;&#x6267;&#x884C;java&#x65B9;&#x6CD5;&#xFF08;&#x4E5F;&#x5C31;&#x662F;&#x5B57;&#x8282;&#x7801;&#xFF09;&#x670D;&#x52A1;&#xFF0C;&#x800C;&#x672C;&#x5730;&#x623F;&#x53D1;&#x6808;&#x5219;&#x4E3A;&#x865A;&#x62DF;&#x673A;&#x4F7F;&#x7528;&#x5230;&#x7684;native&#x65B9;&#x6CD5;&#x670D;&#x52A1;&#x3002;<br>-Xoss&#x63A7;&#x5236;&#x5185;&#x5B58;&#x5927;&#x5C0F;<br><span style="color:red;">|&#x2014;</span> java&#x5806;&#xFF08;Java Heap&#xFF09;&#xFF1A;&#x6240;&#x6709;&#x5BF9;&#x8C61;&#x5B9E;&#x4F8B;&#x4EE5;&#x53CA;&#x6570;&#x7EC4;&#x90FD;&#x8981;&#x5728;&#x5806;&#x4E0A;&#x5206;&#x914D;&#x5185;&#x5B58;&#x3002;&#x6B64;&#x5185;&#x5B58;&#x533A;&#x57DF;&#x552F;&#x4E00;&#x7684;&#x76EE;&#x7684;&#x5C31;&#x662F;&#x5B58;&#x653E;&#x5BF9;&#x8C61;&#x5B9E;&#x4F8B;&#xFF0C;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x7684;&#x5BF9;&#x8C61;&#x5B9E;&#x4F8B;&#x90FD;&#x5728;&#x8FD9;&#x91CC;&#x5206;&#x914D;&#x5185;&#x5B58;<br>    &#x662F;java&#x865A;&#x62DF;&#x673A;&#x6240;&#x7BA1;&#x7406;&#x7684;&#x5185;&#x5B58;&#x4E2D;&#x6700;&#x5927;&#x7684;&#x4E00;&#x5757;<br>    java&#x5806;&#x662F;&#x88AB;&#x6240;&#x6709;&#x7EBF;&#x7A0B;&#x5171;&#x4EAB;&#x7684;&#x4E00;&#x5757;&#x5185;&#x5B58;&#x533A;&#x57DF;&#xFF0C;&#x5728;&#x865A;&#x62DF;&#x673A;&#x542F;&#x52A8;&#x65F6;&#x521B;&#x5EFA;&#x3002;<br>    java&#x5806;&#x662F;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x7BA1;&#x7406;&#x7684;&#x4E3B;&#x8981;&#x533A;&#x57DF;&#xFF0C;&#x6545;&#x4E5F;&#x79F0;&#x201C;GC&#x5806;&#x201D;<br>    &#x6839;&#x636E;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x5206;&#x4EE3;&#x6536;&#x96C6;&#x7B97;&#x6CD5;&#xFF0C;java&#x5806;&#x4E2D;&#x53EF;&#x5206;&#xFF1A;&#x65B0;&#x751F;&#x4EE3;&#x548C;&#x8001;&#x5E74;&#x4EE3;<br>    &#x4ECE;&#x5185;&#x5B58;&#x5206;&#x914D;&#x89D2;&#x5EA6;&#x770B;&#xFF0C;java&#x5806;&#x53EF;&#x80FD;&#x5212;&#x5206;&#x51FA;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x79C1;&#x6709;&#x7684;&#x5206;&#x914D;&#x7F13;&#x51B2;&#x533A;<br>    java&#x5806;&#x53EF;&#x4EE5;&#x5904;&#x4E8E;&#x7269;&#x7406;&#x4E0A;&#x4E0D;&#x8FDE;&#x7EED;&#x7684;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#xFF0C;&#x53EA;&#x8981;&#x903B;&#x8F91;&#x4E0A;&#x662F;&#x8FDE;&#x7EED;&#x7684;&#x5373;&#x53EF;&#x3002;<br>    java&#x865A;&#x62DF;&#x673A;&#x5806;&#x5185;&#x5B58;&#x7684;&#x6269;&#x5C55;&#x901A;&#x8FC7;-Xmx&#x548C;-Xms&#x63A7;&#x5236;<br>    &#x5982;&#x679C;&#x5806;&#x4E2D;&#x6CA1;&#x6709;&#x5185;&#x5B58;&#x5206;&#x914D;&#x7ED9;&#x5BF9;&#x8C61;&#x5B9E;&#x4F8B;&#xFF0C;&#x5E76;&#x4E14;&#x5806;&#x4E5F;&#x65E0;&#x6CD5;&#x6269;&#x5C55;&#xFF0C;&#x5C31;&#x4F1A;&#x629B;&#x51FA;OutOfMemoryError&#x5F02;&#x5E38;&#x3002;&#x4F8B;&#x5982;&#xFF1A;int[] i = new int[1024<em>1024</em>1024];&#x4F1A;&#x629B;&#x6B64;&#x5F02;&#x5E38;&#x3002;<br>    -Xmx&#x6700;&#x5927;&#x503C;&#xFF1B;-Xms&#x6700;&#x5C0F;&#x503C;<br><span style="color:red;">|&#x2014;</span> &#x65B9;&#x6CD5;&#x533A;&#xFF1A;&#x7528;&#x4E8E;&#x5B58;&#x50A8;&#x5DF2;&#x88AB;&#x865A;&#x62DF;&#x673A;&#x52A0;&#x8F7D;&#x7684;&#x7C7B;&#x4FE1;&#x606F;&#x3001;&#x5E38;&#x91CF;&#x3001;&#x9759;&#x6001;&#x53D8;&#x91CF;&#x3001;&#x5373;&#x65F6;&#x7F16;&#x8BD1;&#x5668;&#x7F16;&#x8BD1;&#x540E;&#x7684;&#x4EE3;&#x7801;&#x7B49;&#x6570;&#x636E;&#x3002;<br>    java&#x865A;&#x62DF;&#x673A;&#x628A;&#x65B9;&#x6CD5;&#x533A;&#x63CF;&#x8FF0;&#x4E3A;java&#x5806;&#x7684;&#x903B;&#x8F91;&#x90E8;&#x5206;&#xFF0C;&#x4F46;&#x4ED6;&#x5374;&#x6709;&#x4E2A;&#x522B;&#x540D;&#x201C;Non-Heap&#x201D;,&#x76EE;&#x7684;&#x662F;&#x4E0E;java&#x5806;&#x5206;&#x5F00;&#x6765;&#x3002;<br>    HotSpot&#x865A;&#x62DF;&#x673A;&#x7684;&#x8BBE;&#x8BA1;&#x56E2;&#x961F;&#x4E3A;&#x4E86;&#x50CF;java&#x5806;&#x4E00;&#x6837;&#x3010;&#x5783;&#x573E;&#x6536;&#x96C6;&#x50CF;java&#x5806;&#x4E00;&#x6837;&#x3011;&#x7BA1;&#x7406;&#x65B9;&#x6CD5;&#x533A;&#x5185;&#x5B58;&#xFF0C;&#x628A;&#x65B9;&#x6CD5;&#x533A;&#x88AB;&#x79F0;&#x4E3A;&#x6C38;&#x4E45;&#x4EE3;<br>    &#x65B9;&#x6CD5;&#x533A;&#x5185;&#x5B58;&#x6700;&#x5927;&#x503C;&#x7531;-XX:MaxPermSize&#x63A7;&#x5236; &#xFF1B;-XX:PermSize&#x63A7;&#x5236;&#x6700;&#x5C0F;&#x503C;<br>    &#x73B0;&#x5728;&#x6709;&#x653E;&#x5F03;&#x6C38;&#x4E45;&#x4EE3;&#x5E76;&#x9010;&#x6B65;&#x6539;&#x4E3A;&#x91C7;&#x7528;Native Memory&#x6765;&#x5B9E;&#x73B0;&#x65B9;&#x6CD5;&#x533A;&#x7684;&#x89C4;&#x5212;<br>    &#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x4E3B;&#x8981;&#x9488;&#x5BF9;&#x5E38;&#x91CF;&#x6C60;&#x7684;&#x56DE;&#x6536;&#x548C;&#x5BF9;&#x7C7B;&#x578B;&#x7684;&#x5378;&#x8F7D;&#xFF0C;&#x4F46;&#x56DE;&#x6536;&#x7684;&#x6761;&#x4EF6;&#x5F88;&#x82DB;&#x523B;<br><span style="color:red;">|&#x2014;</span> &#x8FD0;&#x884C;&#x65F6;&#x5E38;&#x91CF;&#x6C60;&#xFF1A;&#x7528;&#x4E8E;&#x5B58;&#x653E;&#x7F16;&#x8BD1;&#x671F;&#x751F;&#x4EA7;&#x7684;&#x5404;&#x79CD;&#x5B57;&#x9762;&#x91CF;&#x548C;&#x7B26;&#x53F7;&#x5F15;&#x7528;</p>
<p><span style="color:red;">|&#x2014;</span> &#x76F4;&#x63A5;&#x5185;&#x5B58;&#xFF1A;&#x5982;&#x679C;&#x4E0D;&#x6307;&#x5B9A;&#x9ED8;&#x8BA4;&#x4E0E;java&#x5806;&#x6700;&#x5927;&#x503C;-Xmx&#x4E00;&#x6837;&#xFF1B;&#x6307;&#x5B9A;&#x901A;&#x8FC7;-XX:MaxDirextMemorySize</p>
<p>&#x8861;&#x91CF;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x6027;&#x80FD;&#x7684;&#x9AD8;&#x4F4E;&#x597D;&#x574F;&#x7684;&#x91CD;&#x8981;&#x6307;&#x6807;&#xFF1A;&#x6BCF;&#x79D2;&#x4E8B;&#x52A1;&#x5904;&#x7406;&#x4E66;&#xFF08;Transactions Per Second&#xFF0C;Tps&#xFF09;&#x2013;&#x5B83;&#x4EE3;&#x8868;1&#x79D2;&#x5185;&#x670D;&#x52A1;&#x7AEF;&#x5E73;&#x5747;&#x80FD;&#x54CD;&#x5E94;&#x7684;&#x8BF7;&#x6C42;&#x603B;&#x6570;<br>java&#x5185;&#x5B58;&#x6A21;&#x578B;&#x89C4;&#x5B9A;&#x4E86;&#x6240;&#x6709;&#x7684;&#x53D8;&#x91CF;&#xFF08;&#x5B9E;&#x4F8B;&#x5B57;&#x6BB5;&#x3001;&#x9759;&#x6001;&#x5B57;&#x6BB5;&#x548C;&#x6784;&#x6210;&#x6570;&#x7EC4;&#x5BF9;&#x8C61;&#x7684;&#x5143;&#x7D20;&#xFF1B;&#x4F46;&#x4E0D;&#x5305;&#x62EC;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x548C;&#x65B9;&#x6CD5;&#x53C2;&#x6570;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E9B;&#x4E8B;&#x7EBF;&#x7A0B;&#x79C1;&#x6709;&#x7684;&#xFF0C;&#x4E0D;&#x4F1A;&#x88AB;&#x5171;&#x4EAB;&#xFF09;&#x90FD;&#x5B58;&#x50A8;&#x5728;&#x4E3B;&#x5185;&#x5B58;&#x4E2D;&#xFF1B;<br>&#x6BCF;&#x4E2A;&#x7EBF;&#x7A0B;&#x8FD8;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#xFF0C;&#x4FDD;&#x5B58;&#x7387;&#x88AB;&#x8BE5;&#x7EBF;&#x7A0B;&#x4F7F;&#x7528;&#x5230;&#x7684;&#x53D8;&#x91CF;&#x7684;&#x4E3B;&#x5185;&#x5B58;&#x526F;&#x672C;&#x62F7;&#x8D1D;&#xFF0C;&#x7EBF;&#x7A0B;&#x5BF9;&#x53D8;&#x91CF;&#x7684;&#x6240;&#x6709;&#x64CD;&#x4F5C;&#xFF08;&#x8BFB;&#x53D6;&#x3001;&#x8D4B;&#x503C;&#x7B49;&#xFF09;&#x90FD;&#x5FC5;&#x987B;&#x5728;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#x4E2D;&#x8FDB;&#x884C;&#xFF0C;&#x800C;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x8BFB;&#x5199;&#x4E3B;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x53D8;&#x91CF;&#x3002;<br>&#x4E0D;&#x540C;&#x7EBF;&#x7A0B;&#x4E4B;&#x95F4;&#x4E5F;&#x65E0;&#x6CD5;&#x76F4;&#x63A5;&#x8BBF;&#x95EE;&#x5BF9;&#x65B9;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x7EBF;&#x7A0B;&#x95F4;&#x53D8;&#x91CF;&#x503C;&#x7684;&#x4F20;&#x9012;&#x5747;&#x9700;&#x901A;&#x8FC7;&#x4E3B;&#x5185;&#x5B58;&#x6765;&#x5B8C;&#x6210;</p>

      
    </div>

    <div>
      
        
      
    </div>

    <div>
      
        

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/JVM/" rel="tag">#JVM</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2017/10/08/Multi-threading/" rel="next" title="多线程问题 一">
                <i class="fa fa-chevron-left"></i> 多线程问题 一
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2017/10/17/vue-environment-install/" rel="prev" title="vue开发环境安装详解">
                vue开发环境安装详解 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/avatar.gif"
               alt="yuyaoxia" />
          <p class="site-author-name" itemprop="name">yuyaoxia</p>
          <p class="site-description motion-element" itemprop="description"></p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">20</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          
            <div class="site-state-item site-state-categories">
              <a href="/categories">
                <span class="site-state-item-count">9</span>
                <span class="site-state-item-name">分类</span>
              </a>
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">18</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        
          <div class="feed-link motion-element">
            <a href="/atom.xml" rel="alternate">
              <i class="fa fa-rss"></i>
              RSS
            </a>
          </div>
        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/yuyaoxia/" target="_blank" title="GitHub">
                  
                    <i class="fa fa-fw fa-github"></i>
                  
                  GitHub
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://twitter.com/your-user-name" target="_blank" title="Twitter">
                  
                    <i class="fa fa-fw fa-twitter"></i>
                  
                  Twitter
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://my.csdn.net/" target="_blank" title="Weibo">
                  
                    <i class="fa fa-fw fa-weibo"></i>
                  
                  Weibo
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://mall.jd.com/index-614139.html" target="_blank" title="JD-SHOP">
                  
                    <i class="fa fa-fw fa-globe"></i>
                  
                  JD-SHOP
                </a>
              </span>
            
          
        </div>

        
        

        
        
          <div class="links-of-blogroll motion-element links-of-blogroll-inline">
            <div class="links-of-blogroll-title">
              <i class="fa  fa-fw fa-globe"></i>
              Links
            </div>
            <ul class="links-of-blogroll-list">
              
                <li class="links-of-blogroll-item">
                  <a href="http://my.csdn.net/" title="CSDN" target="_blank">CSDN</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://zhaxiancheng.com" title="Zhazha" target="_blank">Zhazha</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://le.im" title="le" target="_blank">le</a>
                </li>
              
            </ul>
          </div>
        

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">
            
              
            
            
              <p class="post-toc-empty">此文章未包含目录</p>
            
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">yuyaoxia</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>

        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.0.1"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=5.0.1"></script>



  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.0.1"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.0.1"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.0.1"></script>



  



  



  
  
  <script type="text/javascript">
    // Popup Window;
    var isfetched = false;
    // Search DB path;
    var search_path = "search.xml";
    if (search_path.length == 0) {
       search_path = "search.xml";
    }
    var path = "/" + search_path;
    // monitor main search box;

    function proceedsearch() {
      $("body").append('<div class="popoverlay">').css('overflow', 'hidden');
      $('.popup').toggle();

    }
    // search function;
    var searchFunc = function(path, search_id, content_id) {
    'use strict';
    $.ajax({
        url: path,
        dataType: "xml",
        async: true,
        success: function( xmlResponse ) {
            // get the contents from search data
            isfetched = true;
            $('.popup').detach().appendTo('.header-inner');
            var datas = $( "entry", xmlResponse ).map(function() {
                return {
                    title: $( "title", this ).text(),
                    content: $("content",this).text(),
                    url: $( "url" , this).text()
                };
            }).get();
            var $input = document.getElementById(search_id);
            var $resultContent = document.getElementById(content_id);
            $input.addEventListener('input', function(){
                var matchcounts = 0;
                var str='<ul class=\"search-result-list\">';                
                var keywords = this.value.trim().toLowerCase().split(/[\s\-]+/);
                $resultContent.innerHTML = "";
                if (this.value.trim().length > 1) {
                // perform local searching
                datas.forEach(function(data) {
                    var isMatch = true;
                    var content_index = [];
                    var data_title = data.title.trim().toLowerCase();
                    var data_content = data.content.trim().replace(/<[^>]+>/g,"").toLowerCase();
                    var data_url = data.url;
                    var index_title = -1;
                    var index_content = -1;
                    var first_occur = -1;
                    // only match artiles with not empty titles and contents
                    if(data_title != '' && data_content != '') {
                        keywords.forEach(function(keyword, i) {
                            index_title = data_title.indexOf(keyword);
                            index_content = data_content.indexOf(keyword);
                            if( index_title < 0 && index_content < 0 ){
                                isMatch = false;
                            } else {
                                if (index_content < 0) {
                                    index_content = 0;
                                }
                                if (i == 0) {
                                    first_occur = index_content;
                                }
                            }
                        });
                    }
                    // show search results
                    if (isMatch) {
                        matchcounts += 1;
                        str += "<li><a href='"+ data_url +"' class='search-result-title'>"+ data_title +"</a>";
                        var content = data.content.trim().replace(/<[^>]+>/g,"");
                        if (first_occur >= 0) {
                            // cut out 100 characters
                            var start = first_occur - 20;
                            var end = first_occur + 80;
                            if(start < 0){
                                start = 0;
                            }
                            if(start == 0){
                                end = 50;
                            }
                            if(end > content.length){
                                end = content.length;
                            }
                            var match_content = content.substring(start, end);
                            // highlight all keywords
                            keywords.forEach(function(keyword){
                                var regS = new RegExp(keyword, "gi");
                                match_content = match_content.replace(regS, "<b class=\"search-keyword\">"+keyword+"</b>");
                            });
                            
                            str += "<p class=\"search-result\">" + match_content +"...</p>"
                        }
                        str += "</li>";
                    }
                })};
                str += "</ul>";
                if (matchcounts == 0) { str = '<div id="no-result"><i class="fa fa-frown-o fa-5x" /></div>' }
                if (keywords == "") { str = '<div id="no-result"><i class="fa fa-search fa-5x" /></div>' }
                $resultContent.innerHTML = str;
            });
            proceedsearch();
        }
    });}

    // handle and trigger popup window;
    $('.popup-trigger').mousedown(function(e) {
      e.stopPropagation();
      if (isfetched == false) {
        searchFunc(path, 'local-search-input', 'local-search-result');
      } else {
        proceedsearch();
      };

    });

    $('.popup-btn-close').click(function(e){
      $('.popup').hide();
      $(".popoverlay").remove();
      $('body').css('overflow', '');
    });
    $('.popup').click(function(e){
      e.stopPropagation();
    });
  </script>

  

  

  

</body>
</html>
